Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.IsEqual(Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings)
Compares two vector settings objects.
other:
Vector settings object to compare with.
Returns:
True if objects are equal, false otherwise.
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.ArrowLineWeight
Line weight assigned to arrow lines for vectors.
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.Rounding
Increment to which numeric values of analysis results are rounded in vectors.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
When setting this property: rounding is not positive
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.VectorOrientation
Vector orientation.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.VectorPosition
Vector position.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.ArrowheadScale
Type of arrow head scaling.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.VectorTextType
Type of vector text visualization.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.TextTypeId
Element id of text associated with the settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.#ctor
Constructs a default instance of vector settings.
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings)
Constructs a new copy of the input AnalysisDisplayVectorSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings
Contains vector settings for analysis display style element.
Since:
2012